In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100))
s2 = pd.Series(np.random.randint(1, high=4, size=100))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100))

print(s1, s2, s3)

0     1
1     2
2     4
3     1
4     2
     ..
95    2
96    3
97    4
98    2
99    4
Length: 100, dtype: int64 0     1
1     3
2     2
3     1
4     2
     ..
95    1
96    3
97    1
98    2
99    1
Length: 100, dtype: int64 0     23407
1     17644
2     18240
3     11889
4     18818
      ...
95    25465
96    13300
97    26835
98    10412
99    11391
Length: 100, dtype: int64

In [3]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  1  23407
1  2  3  17644
2  4  2  18240
3  1  1  11889
4  2  2  18818

In [4]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            23407
1      2       3            17644
2      4       2            18240
3      1       1            11889
4      2       2            18818

In [5]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = pd.DataFrame(bigcolumn)
bigcolumn

        0
0       1
1       2
2       4
3       1
4       2
..    ...
95  25465
96  13300
97  26835
98  10412
99  11391

[300 rows x 1 columns]

In [6]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        2
2        4
3        1
4        2
..     ...
295  25465
296  13300
297  26835
298  10412
299  11391

[300 rows x 1 columns]